
var data = [
    [[28604,77,17096869,'院办公室',2015],[31163,77.4,27662440,'信息科',2015],[1516,68,1154605773,'财务科',2015],[13670,74.7,10582082,'总务科',2015],[28599,75,4986705,'医务科',2015],[29476,77.1,56943299,'护理部',2015],[31476,75.4,78958237,'院感科',2015],[28666,78.1,254830,'挂号处',2015],[1777,57.7,870601776,'收费处',2015],[29550,79.1,122249285,'急诊科',2015],[2076,67.9,20194354,'住院部',2015],[12087,72,42972254,'门诊部',2015],[24021,75.4,3397534,'药械科',2015],[43296,76.8,4240375,'放射科',2015],[10088,70.8,38195258,'检验科',2015],[19349,69.6,147568552,'输血科',2015],[10670,67.3,53994605,'餐厅',2015],[26424,75.7,57110117,'洗浆房',2015],[37062,75.4,252847810,'污水处理站',2015]],
    [[44056,81.8,23968973,'院办公室',2016],[43294,81.7,35939927,'信息科',2016],[13334,76.9,1376048943,'财务科',2016],[21291,78.5,11389562,'总务科',2016],[38923,80.8,5503457,'医务科',2016],[37599,81.9,64395345,'护理部',2016],[44053,81.1,80688545,'院感科',2016],[42182,82.8,329425,'挂号处',2016],[5903,66.8,1311050527,'收费处',2016],[36162,83.5,126573481,'急诊科',2016],[1390,71.4,25155317,'住院部',2016],[34644,80.7,50293439,'门诊部',2016],[34186,80.6,4528526,'药械科',2016],[64304,81.6,5210967,'放射科',2016],[24787,77.3,38611794,'检验科',2016],[23038,73.13,143456918,'输血科',2016],[19360,76.5,78665830,'餐厅',2016],[38225,81.4,64715810,'洗浆房',2016],[53354,79.1,321773631,'污水处理站',2016]]
];

var scatteroption = {
    backgroundColor: new echarts.graphic.RadialGradient(0.3, 0.3, 0.8, [{
        offset: 0,
        color: '#f7f8fa'
    }, {
        offset: 1,
        color: '#cdd0d5'
    }]),
    title: {
        text: '2015 与 2016 年各科室指标散点图'
    },
    legend: {
        right: 10,
        data: ['2015', '2016']
    },
    xAxis: {
        splitLine: {
            lineStyle: {
                type: 'dashed'
            }
        }
    },
    yAxis: {
        splitLine: {
            lineStyle: {
                type: 'dashed'
            }
        },
        scale: true
    },
    series: [{
        name: '2015',
        data: data[0],
        type: 'scatter',
        symbolSize: function (data) {
            return Math.sqrt(data[2]) / 5e2;
        },
        label: {
            emphasis: {
                show: true,
                formatter: function (param) {
                    return param.data[3];
                },
                position: 'top'
            }
        },
        itemStyle: {
            normal: {
                shadowBlur: 10,
                shadowColor: 'rgba(120, 36, 50, 0.5)',
                shadowOffsetY: 5,
                color: new echarts.graphic.RadialGradient(0.4, 0.3, 1, [{
                    offset: 0,
                    color: 'rgb(251, 118, 123)'
                }, {
                    offset: 1,
                    color: 'rgb(204, 46, 72)'
                }])
            }
        }
    }, {
        name: '2016',
        data: data[1],
        type: 'scatter',
        symbolSize: function (data) {
            return Math.sqrt(data[2]) / 5e2;
        },
        label: {
            emphasis: {
                show: true,
                formatter: function (param) {
                    return param.data[3];
                },
                position: 'top'
            }
        },
        itemStyle: {
            normal: {
                shadowBlur: 10,
                shadowColor: 'rgba(25, 100, 150, 0.5)',
                shadowOffsetY: 5,
                color: new echarts.graphic.RadialGradient(0.4, 0.3, 1, [{
                    offset: 0,
                    color: 'rgb(129, 227, 238)'
                }, {
                    offset: 1,
                    color: 'rgb(25, 183, 207)'
                }])
            }
        }
    }]
};